{
  "model": "LSTM",
  "layers": [
    {
      "index": 0,
      "name": "lstm",
      "class": "LSTM",
      "config": {
        "name": "lstm",
        "trainable": true,
        "dtype": {
          "module": "keras",
          "class_name": "DTypePolicy",
          "config": {
            "name": "float32"
          },
          "registered_name": null
        },
        "return_sequences": true,
        "return_state": false,
        "go_backwards": false,
        "stateful": false,
        "unroll": false,
        "zero_output_for_mask": false,
        "units": 64,
        "activation": "tanh",
        "recurrent_activation": "sigmoid",
        "use_bias": true,
        "kernel_initializer": {
          "module": "keras.initializers",
          "class_name": "GlorotUniform",
          "config": {
            "seed": null
          },
          "registered_name": null
        },
        "recurrent_initializer": {
          "module": "keras.initializers",
          "class_name": "Orthogonal",
          "config": {
            "seed": null,
            "gain": 1.0
          },
          "registered_name": null
        },
        "bias_initializer": {
          "module": "keras.initializers",
          "class_name": "Zeros",
          "config": {},
          "registered_name": null
        },
        "unit_forget_bias": true,
        "kernel_regularizer": null,
        "recurrent_regularizer": null,
        "bias_regularizer": null,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "recurrent_constraint": null,
        "bias_constraint": null,
        "dropout": 0.0,
        "recurrent_dropout": 0.0,
        "seed": null
      },
      "kernel_var": "LSTM_lstm_kernel_data",
      "recurrent_var": "LSTM_lstm_recurrent_data",
      "bias_var": "LSTM_lstm_bias_data",
      "kernel_shape": [
        1,
        256
      ],
      "recurrent_shape": [
        64,
        256
      ],
      "bias_shape": [
        256
      ]
    },
    {
      "index": 1,
      "name": "dropout",
      "class": "Dropout",
      "config": {
        "name": "dropout",
        "trainable": true,
        "dtype": {
          "module": "keras",
          "class_name": "DTypePolicy",
          "config": {
            "name": "float32"
          },
          "registered_name": null
        },
        "rate": 0.2,
        "seed": null,
        "noise_shape": null
      },
      "skipped": true
    },
    {
      "index": 2,
      "name": "lstm_1",
      "class": "LSTM",
      "config": {
        "name": "lstm_1",
        "trainable": true,
        "dtype": {
          "module": "keras",
          "class_name": "DTypePolicy",
          "config": {
            "name": "float32"
          },
          "registered_name": null
        },
        "return_sequences": false,
        "return_state": false,
        "go_backwards": false,
        "stateful": false,
        "unroll": false,
        "zero_output_for_mask": false,
        "units": 32,
        "activation": "tanh",
        "recurrent_activation": "sigmoid",
        "use_bias": true,
        "kernel_initializer": {
          "module": "keras.initializers",
          "class_name": "GlorotUniform",
          "config": {
            "seed": null
          },
          "registered_name": null
        },
        "recurrent_initializer": {
          "module": "keras.initializers",
          "class_name": "Orthogonal",
          "config": {
            "seed": null,
            "gain": 1.0
          },
          "registered_name": null
        },
        "bias_initializer": {
          "module": "keras.initializers",
          "class_name": "Zeros",
          "config": {},
          "registered_name": null
        },
        "unit_forget_bias": true,
        "kernel_regularizer": null,
        "recurrent_regularizer": null,
        "bias_regularizer": null,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "recurrent_constraint": null,
        "bias_constraint": null,
        "dropout": 0.0,
        "recurrent_dropout": 0.0,
        "seed": null
      },
      "kernel_var": "LSTM_lstm_1_kernel_data",
      "recurrent_var": "LSTM_lstm_1_recurrent_data",
      "bias_var": "LSTM_lstm_1_bias_data",
      "kernel_shape": [
        64,
        128
      ],
      "recurrent_shape": [
        32,
        128
      ],
      "bias_shape": [
        128
      ]
    },
    {
      "index": 3,
      "name": "dropout_1",
      "class": "Dropout",
      "config": {
        "name": "dropout_1",
        "trainable": true,
        "dtype": {
          "module": "keras",
          "class_name": "DTypePolicy",
          "config": {
            "name": "float32"
          },
          "registered_name": null
        },
        "rate": 0.2,
        "seed": null,
        "noise_shape": null
      },
      "skipped": true
    },
    {
      "index": 4,
      "name": "dense",
      "class": "Dense",
      "config": {
        "name": "dense",
        "trainable": true,
        "dtype": {
          "module": "keras",
          "class_name": "DTypePolicy",
          "config": {
            "name": "float32"
          },
          "registered_name": null
        },
        "units": 16,
        "activation": "relu",
        "use_bias": true,
        "kernel_initializer": {
          "module": "keras.initializers",
          "class_name": "GlorotUniform",
          "config": {
            "seed": null
          },
          "registered_name": null
        },
        "bias_initializer": {
          "module": "keras.initializers",
          "class_name": "Zeros",
          "config": {},
          "registered_name": null
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null
      },
      "kernel_var": "LSTM_dense_kernel_data",
      "kernel_shape": [
        32,
        16
      ],
      "bias_var": "LSTM_dense_bias_data",
      "bias_shape": [
        16
      ]
    },
    {
      "index": 5,
      "name": "dropout_2",
      "class": "Dropout",
      "config": {
        "name": "dropout_2",
        "trainable": true,
        "dtype": {
          "module": "keras",
          "class_name": "DTypePolicy",
          "config": {
            "name": "float32"
          },
          "registered_name": null
        },
        "rate": 0.1,
        "seed": null,
        "noise_shape": null
      },
      "skipped": true
    },
    {
      "index": 6,
      "name": "dense_1",
      "class": "Dense",
      "config": {
        "name": "dense_1",
        "trainable": true,
        "dtype": {
          "module": "keras",
          "class_name": "DTypePolicy",
          "config": {
            "name": "float32"
          },
          "registered_name": null
        },
        "units": 8,
        "activation": "relu",
        "use_bias": true,
        "kernel_initializer": {
          "module": "keras.initializers",
          "class_name": "GlorotUniform",
          "config": {
            "seed": null
          },
          "registered_name": null
        },
        "bias_initializer": {
          "module": "keras.initializers",
          "class_name": "Zeros",
          "config": {},
          "registered_name": null
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null
      },
      "kernel_var": "LSTM_dense_1_kernel_data",
      "kernel_shape": [
        16,
        8
      ],
      "bias_var": "LSTM_dense_1_bias_data",
      "bias_shape": [
        8
      ]
    },
    {
      "index": 7,
      "name": "dense_2",
      "class": "Dense",
      "config": {
        "name": "dense_2",
        "trainable": true,
        "dtype": {
          "module": "keras",
          "class_name": "DTypePolicy",
          "config": {
            "name": "float32"
          },
          "registered_name": null
        },
        "units": 1,
        "activation": "linear",
        "use_bias": true,
        "kernel_initializer": {
          "module": "keras.initializers",
          "class_name": "GlorotUniform",
          "config": {
            "seed": null
          },
          "registered_name": null
        },
        "bias_initializer": {
          "module": "keras.initializers",
          "class_name": "Zeros",
          "config": {},
          "registered_name": null
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null
      },
      "kernel_var": "LSTM_dense_2_kernel_data",
      "kernel_shape": [
        8,
        1
      ],
      "bias_var": "LSTM_dense_2_bias_data",
      "bias_shape": [
        1
      ]
    }
  ]
}