{
  "model": "TRN",
  "layers": [
    {
      "index": 0,
      "name": "conv1d",
      "class": "Conv1D",
      "config": {
        "name": "conv1d",
        "trainable": true,
        "dtype": {
          "module": "keras",
          "class_name": "DTypePolicy",
          "config": {
            "name": "float32"
          },
          "registered_name": null
        },
        "filters": 32,
        "kernel_size": [
          2
        ],
        "strides": [
          1
        ],
        "padding": "valid",
        "data_format": "channels_last",
        "dilation_rate": [
          1
        ],
        "groups": 1,
        "activation": "relu",
        "use_bias": true,
        "kernel_initializer": {
          "module": "keras.initializers",
          "class_name": "GlorotUniform",
          "config": {
            "seed": null
          },
          "registered_name": null
        },
        "bias_initializer": {
          "module": "keras.initializers",
          "class_name": "Zeros",
          "config": {},
          "registered_name": null
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null
      },
      "kernel_var": "TRN_conv1d_kernel_data",
      "kernel_shape": [
        2,
        1,
        32
      ],
      "bias_var": "TRN_conv1d_bias_data",
      "bias_shape": [
        32
      ]
    },
    {
      "index": 1,
      "name": "conv1d_1",
      "class": "Conv1D",
      "config": {
        "name": "conv1d_1",
        "trainable": true,
        "dtype": {
          "module": "keras",
          "class_name": "DTypePolicy",
          "config": {
            "name": "float32"
          },
          "registered_name": null
        },
        "filters": 64,
        "kernel_size": [
          2
        ],
        "strides": [
          1
        ],
        "padding": "valid",
        "data_format": "channels_last",
        "dilation_rate": [
          1
        ],
        "groups": 1,
        "activation": "relu",
        "use_bias": true,
        "kernel_initializer": {
          "module": "keras.initializers",
          "class_name": "GlorotUniform",
          "config": {
            "seed": null
          },
          "registered_name": null
        },
        "bias_initializer": {
          "module": "keras.initializers",
          "class_name": "Zeros",
          "config": {},
          "registered_name": null
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null
      },
      "kernel_var": "TRN_conv1d_1_kernel_data",
      "kernel_shape": [
        2,
        32,
        64
      ],
      "bias_var": "TRN_conv1d_1_bias_data",
      "bias_shape": [
        64
      ]
    },
    {
      "index": 2,
      "name": "flatten_1",
      "class": "Flatten",
      "config": {
        "name": "flatten_1",
        "trainable": true,
        "dtype": {
          "module": "keras",
          "class_name": "DTypePolicy",
          "config": {
            "name": "float32"
          },
          "registered_name": null
        },
        "data_format": "channels_last"
      },
      "skipped": true
    },
    {
      "index": 3,
      "name": "dense_7",
      "class": "Dense",
      "config": {
        "name": "dense_7",
        "trainable": true,
        "dtype": {
          "module": "keras",
          "class_name": "DTypePolicy",
          "config": {
            "name": "float32"
          },
          "registered_name": null
        },
        "units": 64,
        "activation": "relu",
        "use_bias": true,
        "kernel_initializer": {
          "module": "keras.initializers",
          "class_name": "GlorotUniform",
          "config": {
            "seed": null
          },
          "registered_name": null
        },
        "bias_initializer": {
          "module": "keras.initializers",
          "class_name": "Zeros",
          "config": {},
          "registered_name": null
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null
      },
      "kernel_var": "TRN_dense_7_kernel_data",
      "kernel_shape": [
        3712,
        64
      ],
      "bias_var": "TRN_dense_7_bias_data",
      "bias_shape": [
        64
      ]
    },
    {
      "index": 4,
      "name": "dense_8",
      "class": "Dense",
      "config": {
        "name": "dense_8",
        "trainable": true,
        "dtype": {
          "module": "keras",
          "class_name": "DTypePolicy",
          "config": {
            "name": "float32"
          },
          "registered_name": null
        },
        "units": 1,
        "activation": "linear",
        "use_bias": true,
        "kernel_initializer": {
          "module": "keras.initializers",
          "class_name": "GlorotUniform",
          "config": {
            "seed": null
          },
          "registered_name": null
        },
        "bias_initializer": {
          "module": "keras.initializers",
          "class_name": "Zeros",
          "config": {},
          "registered_name": null
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null
      },
      "kernel_var": "TRN_dense_8_kernel_data",
      "kernel_shape": [
        64,
        1
      ],
      "bias_var": "TRN_dense_8_bias_data",
      "bias_shape": [
        1
      ]
    }
  ]
}